БухЭксп/InformationRegisters/CW_НастройкаЗависмыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НастройкаЗависмыхУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НастройкаЗависмыхУслуг/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если СписокУслуг.Количество()= 1 тогда
			Отказ = истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОграничиватьУслугиПоДоговорам 				= ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам");
	ИспользованиеСхемыПеревыставленияПоСтавкам 	= ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	
	//Услуги по договру
	Если ОграничиватьУслугиПоДоговорам Тогда
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Запись.Договор), Запись.Договор.ОграничиватьНоменклатуру, Ложь);
		Если ЕстьОграниченияПоСпискуУслуг Тогда
			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ТекущаяДата(),Запись.Договор, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ТекущаяДата();
	СтруктураПараметров.Договор 			= Запись.Договор;
	
	Если Запись.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком тогда
		
		ПараметрыДоговора			= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ОсновнойПорядокОтраженияРасходов");
		ОсновнойПорядокОтражения	= ПараметрыДоговора.ОсновнойПорядокОтраженияРасходов;
		
		ЗависимыеУслугиУчитыватьГруз				= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьГрузПоВходящим");
		ЗависимыеУслугиУчитыватьКлиентаПоВходящим 	= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим");
		
		Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление);
		Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Затраты);
		
		Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
			Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам);
		КонецЕсли;	
	
	ИначеЕсли  Запись.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем тогда
		
		ПараметрыДоговора			= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ОсновнойПорядокОтраженияДоходов");
		ОсновнойПорядокОтражения	= ПараметрыДоговора.ОсновнойПорядокОтраженияДоходов;
		
		ЗависимыеУслугиУчитыватьГруз 				= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим");
		ЗависимыеУслугиУчитыватьКлиентаПоВходящим 	= Ложь;
		
		Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление);
		Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга);
		
		Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
			Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
		КонецЕсли;		
	
	КонецЕсли;
		
	Если Параметры.Ключ.Пустой() Тогда
		НоваяСтрока 					= СписокУслуг.Добавить();
		НоваяСтрока.ПорядокОтражения 	= ОсновнойПорядокОтражения;
	Иначе
		ЗаполнитьДанныеСтроки();
	КонецЕсли;
	
	Элементы.Клиент.Видимость 	= ЗависимыеУслугиУчитыватьКлиентаПоВходящим;
	Элементы.Груз.Видимость 	= ЗависимыеУслугиУчитыватьГруз;
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.УслугаДокумента);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.СписокУслугНоменклатура);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтроки()
	
	НоваяСтрока = СписокУслуг.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыСтроки(СтрокаТекущая)
	
	СтрокаТекущая.Сумма = СтрокаТекущая.Цена * СтрокаТекущая.Количество;
	СтрокаТекущая.НДС = СтрокаТекущая.Сумма * СтавкаНДС(СтрокаТекущая.СтавкаНДС)/100;
	СтрокаТекущая.Всего = СтрокаТекущая.Сумма + СтрокаТекущая.НДС;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.СписокУслуг.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура СписокУслугЦенаПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.СписокУслуг.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСуммаПриИзменении(Элемент)
	
	СуммаПриИзменении(Элементы.СписокУслуг.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура СуммаПриИзменении(ТекущаяСтрока)
	
	СтрокаТекущая 		= СписокУслуг.НайтиПоИдентификатору(ТекущаяСтрока);
	
	СтрокаТекущая.Цена 	= _сф.БезопасноРазделить(СтрокаТекущая.Сумма,СтрокаТекущая.Количество);
	Ставка 				= CW_Финансы.ПолучитьСтавкуНДС(СтрокаТекущая.СтавкаНДС);
	СтрокаТекущая.НДС 	= CW_Финансы.РассчитатьСуммуНДС(СтрокаТекущая.Сумма, Истина, Ложь, Ставка);
	СтрокаТекущая.Всего = СтрокаТекущая.Сумма + СтрокаТекущая.НДС;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокУслугСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.СписокУслуг.ТекущиеДанные);

КонецПроцедуры


&НаКлиенте
Процедура СписокУслугНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокУслуг.ТекущиеДанные;
	
	ТекущиеДанные.Всего = ТекущиеДанные.Сумма + ТекущиеДанные.НДС;

КонецПроцедуры


&НаКлиенте
Процедура СписокУслугВсегоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокУслуг.ТекущиеДанные;
	
	
	Ставка 				= СтавкаНДС(ТекущиеДанные.СтавкаНДС)/100;
	ТекущиеДанные.НДС 	= ТекущиеДанные.Всего*Ставка/(1+Ставка);
	ТекущиеДанные.Сумма = ТекущиеДанные.Всего - ТекущиеДанные.НДС;
	ТекущиеДанные.Цена 	= _сф.БезопасноРазделить(ТекущиеДанные.Сумма,ТекущиеДанные.Количество);

КонецПроцедуры

&НаКлиенте
Функция СтавкаНДС(Ставка)
	
	Возврат CW_Финансы.ПолучитьСтавкуНДС(Ставка);
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекущаяСтрока = СписокУслуг[0];
	
	ЗаполнитьЗначенияСвойств(Запись, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередУдалением(Элемент, Отказ)
	
	Откза = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	//Услуги по договру
	Если ОграничиватьУслугиПоДоговорам Тогда
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Запись.Договор), Запись.Договор.ОграничиватьНоменклатуру, Ложь);
		Если ЕстьОграниченияПоСпискуУслуг Тогда
			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ТекущаяДата(),Запись.Договор, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.УслугаДокумента);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.СписокУслугНоменклатура);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокУслуг.ТекущиеДанные;
	ТекущиеДанные.СтавкаНДС =  ПолучитьСтавкуНДС(ТекущиеДанные.Номенклатура);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтавкуНДС(тНоменклатура)
	
	Возврат  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(тНоменклатура);
	
КонецФункции

&НаКлиенте
Процедура УслугаДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЕстьОграниченияПоСпискуУслуг Тогда
	//	СтандартнаяОбработка	= Ложь;
		ДанныеВыбора			= Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура СписокУслугНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЕстьОграниченияПоСпискуУслуг Тогда
	//	СтандартнаяОбработка	= Ложь;
		ДанныеВыбора			= Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));
	КонецЕсли;
	
КонецПроцедуры
